// Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

int p, n; 

p = 0; 
n = 8;

    while (p < n)
    {
        if (p % 2 > 0)
        {

        }
        else
        {
            Console.WriteLine(p + 2);
        }
        p = p + 1;
    }
   
